In [4]:
import pandas as pd

# Student Table

In [5]:
studentdf = pd.read_csv('raw-csv-files/student.csv')
studentdf

    ID                  Name                             Email
0    1              John Doe              john.doe@example.com
1    2              Jane Doe              jane.doe@example.com
2    3            Mary Smith            mary.smith@example.com
3    4           Peter Jones           peter.jones@example.com
4    5           Susan Brown           susan.brown@example.com
5    6        David Williams        david.williams@example.com
6    7         Emily Johnson         emily.johnson@example.com
7    8        Michael Garcia        michael.garcia@example.com
8    9     Jessica Rodriguez     jessica.rodriguez@example.com
9   10  Christopher Gonzalez  christopher.gonzalez@example.com
10  11          Robert Smith          robert.smith@example.com
11  12           Sarah Jones           sarah.jones@example.com
12  13         William Brown         william.brown@example.com
13  14        Linda Williams        linda.williams@example.com
14  15       Anthony Johnson       anthony.johnson@example.com
15  16          Maria Garcia          maria.garcia@example.com
16  17      Daniel Rodriguez      daniel.rodriguez@example.com
17  18         Luis Gonzalez         luis.gonzalez@example.com
18  19        Jennifer Smith        jennifer.smith@example.com
19  20           James Jones           james.jones@example.com

Dropping email column and making ID the index.

In [6]:
studentdf = studentdf.drop(columns='Email')
studentdf = studentdf.set_index('ID')
studentdf

                    Name
ID
1               John Doe
2               Jane Doe
3             Mary Smith
4            Peter Jones
5            Susan Brown
6         David Williams
7          Emily Johnson
8         Michael Garcia
9      Jessica Rodriguez
10  Christopher Gonzalez
11          Robert Smith
12           Sarah Jones
13         William Brown
14        Linda Williams
15       Anthony Johnson
16          Maria Garcia
17      Daniel Rodriguez
18         Luis Gonzalez
19        Jennifer Smith
20           James Jones

# Teacher Table

In [7]:
teacherdf = pd.read_csv('raw-csv-files/teacher.csv')
teacherdf

    ID              Name                         Email
0    1       Sarah Hanks       sarah.hanks@example.com
1    2     Michael Jones     michael.jones@example.com
2    3       David Green       david.green@example.com
3    4    Sarah Williams    sarah.williams@example.com
4    5     Peter Johnson     peter.johnson@example.com
5    6        Mary Green        mary.green@example.com
6    7    James Anderson    james.anderson@example.com
7    8       Emily Brown       emily.brown@example.com
8    9      Thomas Green      thomas.green@example.com
9   10  Jessica Williams  jessica.williams@example.com
10  11   William Johnson   william.johnson@example.com
11  12      Ashley Brown      ashley.brown@example.com
12  13      Daniel Jones      daniel.jones@example.com
13  14       Sarah Green       sarah.green@example.com
14  15  Michael Williams  michael.williams@example.com
15  16    Karis Williams    karis.williams@example.com
16  17       Ava Johnson       ava.johnson@example.com
17  18        Liam Green        liam.green@example.com
18  19      Paige Marris      paige.marris@example.com
19  20       Noah Anders      noah.johnson@example.com

Dropping email column and making ID the index.

In [8]:
teacherdf = teacherdf.drop(columns='Email')
teacherdf = teacherdf.set_index('ID')
teacherdf

                Name
ID
1        Sarah Hanks
2      Michael Jones
3        David Green
4     Sarah Williams
5      Peter Johnson
6         Mary Green
7     James Anderson
8        Emily Brown
9       Thomas Green
10  Jessica Williams
11   William Johnson
12      Ashley Brown
13      Daniel Jones
14       Sarah Green
15  Michael Williams
16    Karis Williams
17       Ava Johnson
18        Liam Green
19      Paige Marris
20       Noah Anders

# Course Table

In [9]:
coursedf = pd.read_csv('raw-csv-files/course.csv')
coursedf

    ID                    Name             Subject
0    1                Math 101                Math
1    2             English 101             English
2    3             Science 101             Science
3    4             History 101             History
4    5    Computer Science 101    Computer Science
5    6             Spanish 101             Spanish
6    7              French 101              French
7    8              German 101              German
8    9                 Art 101                 Art
9   10               Music 101               Music
10  11  Physical Education 101  Physical Education
11  12              Health 101              Health
12  13  Driver's Education 101  Driver's Education
13  14      Home Economics 101      Home Economics
14  15         Woodworking 101         Woodworking
15  16        Metalworking 101        Metalworking
16  17      Auto Mechanics 101      Auto Mechanics
17  18       Culinary Arts 101       Culinary Arts
18  19      Fashion Design 101      Fashion Design
19  20          Journalism 101          Journalism

Making ID the index.

In [10]:
coursedf = coursedf.set_index('ID')
coursedf

                      Name             Subject
ID
1                 Math 101                Math
2              English 101             English
3              Science 101             Science
4              History 101             History
5     Computer Science 101    Computer Science
6              Spanish 101             Spanish
7               French 101              French
8               German 101              German
9                  Art 101                 Art
10               Music 101               Music
11  Physical Education 101  Physical Education
12              Health 101              Health
13  Driver's Education 101  Driver's Education
14      Home Economics 101      Home Economics
15         Woodworking 101         Woodworking
16        Metalworking 101        Metalworking
17      Auto Mechanics 101      Auto Mechanics
18       Culinary Arts 101       Culinary Arts
19      Fashion Design 101      Fashion Design
20          Journalism 101          Journalism

# Administrator Table

In [11]:
admindf = pd.read_csv('raw-csv-files/admin.csv')
admindf

    ID             Name                        Email
0    1     Noah Johnson     noah.johnson@example.com
1    2     Amelia Brown     amelia.brown@example.com
2    3   Benjamin Green   benjamin.green@example.com
3    4  Charlotte Jones  charlotte.jones@example.com
4    5  Daniel Campbell  daniel.campbell@example.com
5    6    Abigail Jones    abigail.jones@example.com
6    7   Benjamin Brown   benjamin.brown@example.com
7    8   Caroline Moore   caroline.moore@example.com
8    9    Daniel Sander    daniel.sander@example.com
9   10      Emily Davis      emily.davis@example.com
10  11   Felicia Addams   felicia.addams@example.com
11  12  Gabriel Sanchez  gabriel.sanchez@example.com
12  13        Henry Lee        henry.lee@example.com
13  14   Isabella Allen   isabella.allen@example.com
14  15       James Kenn       james.kenn@example.com
15  16    Edward Levine    edward.levine@example.com
16  17     Clayton Peck     clayton.peck@example.com
17  18   Cara Hernandez   cara.hernandez@example.com
18  19        Adam Bell        adam.bell@example.com
19  20     Kathy Valdez     kathy.valdez@example.com

Dropping email column and making ID the index.

In [12]:
admindf = admindf.drop(columns='Email')
admindf = admindf.set_index('ID')
admindf

               Name
ID
1      Noah Johnson
2      Amelia Brown
3    Benjamin Green
4   Charlotte Jones
5   Daniel Campbell
6     Abigail Jones
7    Benjamin Brown
8    Caroline Moore
9     Daniel Sander
10      Emily Davis
11   Felicia Addams
12  Gabriel Sanchez
13        Henry Lee
14   Isabella Allen
15       James Kenn
16    Edward Levine
17     Clayton Peck
18   Cara Hernandez
19        Adam Bell
20     Kathy Valdez

# Grades Table

In [13]:
gradesdf = pd.read_csv('raw-csv-files/grades.csv')
gradesdf

    Grade ID  Student ID  Course ID  Grade
0          1           1          1     90
1          2           2          2     80
2          3           3          3     70
3          4           4          4     60
4          5           5          5     50
5          6           6          6     40
6          7           7          7     30
7          8           8          8     20
8          9           9          9     10
9         10          10         10      0
10        11          11          1     90
11        12          12          2     80
12        13          13          3     70
13        14          14          4     60
14        15          15          5     50
15        16          16          6     40
16        17          17          7     30
17        18          18          8     20
18        19          19          9     10
19        20          20         10      0

Rename 'Grade ID' column to just 'ID' and make ID the index

In [14]:
gradesdf.rename(columns={'Grade ID': 'ID'}, inplace=True)
gradedf = gradesdf.set_index('ID')
gradedf

    Student ID  Course ID  Grade
ID
1            1          1     90
2            2          2     80
3            3          3     70
4            4          4     60
5            5          5     50
6            6          6     40
7            7          7     30
8            8          8     20
9            9          9     10
10          10         10      0
11          11          1     90
12          12          2     80
13          13          3     70
14          14          4     60
15          15          5     50
16          16          6     40
17          17          7     30
18          18          8     20
19          19          9     10
20          20         10      0

# Load to CSV

Pushing clean datasets to their respective csv files

In [16]:
admindf.to_csv('clean-csv-files/admindf_clean.csv')
coursedf.to_csv('clean-csv-files/coursedf_clean.csv') 
gradesdf.to_csv('clean-csv-files/gradesdf_clean.csv') 
studentdf.to_csv('clean-csv-files/studentdf_clean.csv') 
teacherdf.to_csv('clean-csv-files/teacherdf_clean.csv')

# Visualizations